% ознайомлення з  командами zeros, оnеs, еуе, rand, randn. 
% Створення матриць даного виду з вхідними аргументами m=1, n=3
help zeros
a=zeros(1,3)
help ones
b= ones(1,3)
help eye
c=eye(1,3)
help rand
d= rand(1,3)
help randn
d= randn(1,3)


%створення матриці виду а = zeros (m, n). присвоювання ненульового значення елементу а(k, l) а) для k<m, l<n; б) k>m, l>n.
a=zeros(5,12)
%а
a(2,10)
%б
a(6,15)
% попередня матриця, сформована функцією rand
b=rand(5,12)
%a
b(2,10)
%б
b(6,15)

%ознайомлення з переліком елементарних операцій з матрицями
help elmat
% ознайомлення з переліком матричних функцій лінійної алгебри 
help matfun
% введення матриць А,В
A=[1 2 3 4 5; 6 7 8 9 11]
B=[0 -1 -2 -3 -4; 5 6 7 8 9]
%горизонтальна конкатенація
d1=[A,B]
%вертикальна конкатенація
d2=[A;B]
%знаходження суми та різниці матриць
k1=A+B
k2=A-B
%просте та поелементне множення матриць відповідно
t1=A*B
t2=A.*B
%транспонування матриць
f1=transpose(A)
f2=transpose (B)
%обчислення  матриці С як результат множення матриці А на транспоновану В
C=A*f2
%знаходження оберненої до С матрицю. Перевірка
inv(C)
inv(C)*C
%детермінант С
det(C)
%введення полінома, обчислення його коренів,побудова вектора коефіцієнтів
%полінома, обчислення значень полінома ля заданих значень аргументу,
%представлення поліному у наочній формі рядка
z=-0.5
p=[1 -2 0 0 1 0 -18]
r=roots(p)
p1=poly(r)
h1=polyval(p1,-0.5)
v1=poly2str(p,z)

z=-0.3
p=[1 -2 0 0 1 0 -18]
r=roots(p)
p2=poly(r)
h2=polyval(p2,-0.3)
v2=poly2str(p,z)

z=-0.2
p=[1 -2 0 0 1 0 -18]
r=roots(p)
p3=poly(r)
h3=polyval(p3,-0.2)
v3=poly2str(p,z)

z=0
p=[1 -2 0 0 1 0 -18]
r=roots(p)
p4=poly(r)
h4=polyval(p4,0)
v4=poly2str(p,z)

z=0.4
p=[1 -2 0 0 1 0 -18]
r=roots(p)
p5=poly(r)
h5=polyval(p5,0.4)
v5=poly2str(p,z)

z=0.8
p=[1 -2 0 0 1 0 -18]
r=roots(p)
p6=poly(r)
h6=polyval(p6,0.8)
v6=poly2str(p,z)



